; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-7-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s2)
	(at driver5 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s0)
	(at package2 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s1)
	(at driver5 s1)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s0)
	(at truck6 s0)
	(at truck7 s0)
	(at package1 s0)
	(at package2 s2)
	))


)

; plan
1. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 4 of 12
2. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 4 of 12
3. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 4 of 12
4. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 5 of 12
5. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   goals met: 4 of 12
6. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   goals met: 4 of 12
7. (board-truck driver4 truck5 s2)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 4 of 12
8. (drive-truck truck5 s2 s0 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 5 of 12
9. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 5 of 12
10. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 12
11. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 5 of 12
12. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 12
13. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 6 of 12
14. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 7 of 12
15. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 8 of 12
16. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 9 of 12
17. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 10 of 12
18. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 11 of 12
19. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   goals met: 11 of 12
20. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   goals met: 11 of 12
21. (board-truck driver4 truck7 s2)
   deleted: (at driver4 s2) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 11 of 12
22. (drive-truck truck7 s2 s0 driver4)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   goals met: 12 of 12
